In [1]:
from sklearn import datasets
import pandas as pd
import numpy as np

In [2]:
titanic_train = pd.read_csv("0000000000002429_training_titanic_x_y_train.csv",delimiter = ",")
titanic_test = pd.read_csv("0000000000002429_test_titanic_x_test.csv",delimiter = ",")

In [4]:
titanic_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 668 entries, 0 to 667
Data columns (total 11 columns):
Pclass      668 non-null int64
Name        668 non-null object
Sex         668 non-null object
Age         536 non-null float64
SibSp       668 non-null int64
Parch       668 non-null int64
Ticket      668 non-null object
Fare        668 non-null float64
Cabin       154 non-null object
Embarked    667 non-null object
Survived    668 non-null int64
dtypes: float64(2), int64(4), object(5)
memory usage: 57.5+ KB

In [5]:
titanic_train.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,2,"Weisz, Mrs. Leopold (Mathilde Francoise Pede)",female,29.0,1,0,228414,26.000,NaN,S,1
1,3,"Williams, Mr. Howard Hugh ""Harry""",male,NaN,0,0,A/5 2466,8.050,NaN,S,0
2,2,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",male,39.0,0,0,250655,26.000,NaN,S,0
3,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",female,29.0,0,4,349909,21.075,NaN,S,0
4,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.050,NaN,S,0

In [6]:
ports = pd.get_dummies(titanic_train.Embarked , prefix='Embarked')

In [8]:
titanic_train = titanic_train.join(ports)
titanic_train.drop(['Embarked'], axis=1, inplace=True)

In [9]:
titanic_train

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Survived,Embarked_C,Embarked_Q,Embarked_S
0,2,"Weisz, Mrs. Leopold (Mathilde Francoise Pede)",female,29.0,1,0,228414,26.0000,NaN,1,0,0,1
1,3,"Williams, Mr. Howard Hugh ""Harry""",male,NaN,0,0,A/5 2466,8.0500,NaN,0,0,0,1
2,2,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",male,39.0,0,0,250655,26.0000,NaN,0,0,0,1
3,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",female,29.0,0,4,349909,21.0750,NaN,0,0,0,1
4,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,0,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
663,2,"Ilett, Miss. Bertha",female,17.0,0,0,SO/C 14885,10.5000,NaN,1,0,0,1
664,3,"Morrow, Mr. Thomas Rowan",male,NaN,0,0,372622,7.7500,NaN,0,0,1,0
665,3,"Bing, Mr. Lee",male,32.0,0,0,1601,56.4958,NaN,1,0,0,1
666,3,"Strandberg, Miss. Ida Sofia",female,22.0,0,0,7553,9.8375,NaN,0,0,0,1
667,3,"Murphy, Miss. Katherine ""Kate""",female,NaN,1,0,367230,15.5000,NaN,1,0,1,0

In [2]:
titanic_train.Sex = titanic_train.Sex.map({'male':0, 'female':1})

In [13]:
Y = titanic_train["Survived"]
X = titanic_train.drop('Survived',axis=1)

In [17]:
X.drop(['Cabin','Ticket','Name'],axis = 1,inplace = True)

In [18]:
X.isnull().any()

Pclass        False
Sex           False
Age            True
SibSp         False
Parch         False
Fare          False
Embarked_C    False
Embarked_Q    False
Embarked_S    False
dtype: bool

In [19]:
X.Age.fillna(X.Age.mean(), inplace=True)

In [20]:
X.isnull().any()

Pclass        False
Sex           False
Age           False
SibSp         False
Parch         False
Fare          False
Embarked_C    False
Embarked_Q    False
Embarked_S    False
dtype: bool

In [22]:
from sklearn.model_selection import train_test_split

In [23]:
X_train, X_test, y_train, y_test = train_test_split(X, Y,test_size=0.2)

In [24]:
from sklearn.linear_model import LogisticRegression

In [38]:
clsf = LogisticRegression(solver= 'liblinear',max_iter = 150,C=0.9)
clsf.fit(X_train,y_train)

LogisticRegression(C=0.9, class_weight=None, dual=False, fit_intercept=True,
          intercept_scaling=1, max_iter=150, multi_class='warn',
          n_jobs=None, penalty='l2', random_state=None, solver='liblinear',
          tol=0.0001, verbose=0, warm_start=False)

In [39]:
clsf.score(X_train,y_train)

0.7902621722846442

In [40]:
clsf.score(X_test,y_test)

0.7910447761194029

In [41]:
titanic_test.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,2,"Davies, Master. John Morgan Jr",male,8.0,1,1,C.A. 33112,36.7500,NaN,S
1,1,"Leader, Dr. Alice (Farnham)",female,49.0,0,0,17465,25.9292,D17,S
2,3,"Kilgannon, Mr. Thomas J",male,NaN,0,0,36865,7.7375,NaN,Q
3,2,"Jacobsohn, Mrs. Sidney Samuel (Amy Frances Chr...",female,24.0,2,1,243847,27.0000,NaN,S
4,1,"McGough, Mr. James Robert",male,36.0,0,0,PC 17473,26.2875,E25,S

In [42]:
ports = pd.get_dummies(titanic_test.Embarked , prefix='Embarked')

In [43]:
titanic_test = titanic_test.join(ports)
titanic_test.drop(['Embarked'], axis=1, inplace=True)

In [44]:
titanic_test.Sex = titanic_test.Sex.map({'male':0, 'female':1})

In [45]:
titanic_test.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked_C,Embarked_Q,Embarked_S
0,2,"Davies, Master. John Morgan Jr",0,8.0,1,1,C.A. 33112,36.7500,NaN,0,0,1
1,1,"Leader, Dr. Alice (Farnham)",1,49.0,0,0,17465,25.9292,D17,0,0,1
2,3,"Kilgannon, Mr. Thomas J",0,NaN,0,0,36865,7.7375,NaN,0,1,0
3,2,"Jacobsohn, Mrs. Sidney Samuel (Amy Frances Chr...",1,24.0,2,1,243847,27.0000,NaN,0,0,1
4,1,"McGough, Mr. James Robert",0,36.0,0,0,PC 17473,26.2875,E25,0,0,1

In [46]:
titanic_test.drop(['Cabin','Ticket','Name'],axis = 1,inplace = True)

In [57]:
titanic_test.head()
titanic_test.shape

(223, 9)

In [50]:
titanic_test.Age.fillna(titanic_test.Age.mean(), inplace=True)

In [51]:
predicted_result = clsf.predict(titanic_test)

In [56]:
print(len(predicted_result))

223

In [58]:
np.savetxt('titanic_results.csv', predicted_result, delimiter=',',fmt='%1.5f')